from re import findall

s = open("24-actual/demo_2025_24.txt").read()

# Создаем регулярное выражение для корректных выражений
# (?:0|[6-9][0-9]*) - число без ведущих нулей
# (?:[-*]) - операция

# pattern = r'(?:0|[1-9][0-9]*)(?:[-*](?:0|[1-9][0-9]*))*'

# pattern = r'(?:0|[1-9][0-9]*)(?:[-*](?:0|[1-9][0-9]*))*'

# pattern = r'(?:0|[1-9][0-9]*)(?:[-*](?:0|[1-9][0-9]*))*'
# pattern = r'\d+(?:[-*]\d+)*'
pattern = r'(?:0|[1-9]\d*)(?:[-*](?:0|[1-9]\d*))*'

num = '(?:0|[1-9][0-9]*)'
pattern = f'{num}(?:[-*]{num})*'




# pattern = r'[1-9][0-9]*([-*]+[1-9][0-9]*)*'

matches = findall(pattern, s)

max_length = max(matches , key=len)

print(len(max_length)  )