'''
# Алгоритм вычисления функций F(n) и G(n), где n — целое число,
# задан следующими соотношениями:

# F(n) = F(n - 8) + 1095, если n >= 21
# F(n) = 10 * (G(n - 7) - 36), если n < 21

# G(n) = n/23 + 33, если n >= 22560
# G(n) = G(n + 11) - 4, если n < 22560

# Чему равно значение функции F(548)?

'''


F = [0] * 550

G = [0] * (22601)

for n in range(22600, -1, -1):
    if n >= 22560:
        G[n] = n // 23 + 33
    else:
        G[n] = G[n + 11] - 4

for n in range(13, 549):
    if n >= 21:
        F[n] = F[n - 8] + 1095
    else:
        F[n] = 10 * (G[n - 7] - 36)

print(F[548]) # 50