'''
(В. Лашин) Текстовый файл состоит из десятичных цифр и заглавных букв латинского алфавита. Определите в прилагаемом файле подстроку максимальной длины, у которой префикс будет совпадать с суффиксом. Префиксом и суффиксом подстроки не может являться сама подстрока.

В информатике принято называть префиксом и суффиксом следующие понятия:

Префикс — начало строки.

Суффикс — её конец.

Например, у строки "ЕГЭ", префиксы будут "Е", "ЕГ", а суффиксы "Э", "ГЭ"
В ответе запишите число — количество символов в найденной последовательности.

--- На пальцах ---


'''





# 18
