'''
(В. Лашин) Текстовый файл состоит из десятичных цифр, латинских заглавных букв, знаков «+» и «*» (сложения и умножения). Определите максимальное количество символов в непрерывной последовательности, являющейся корректным арифметическим выражением в шестнадцатиричной системе счисления с целыми неотрицательными числами (без знака). В этом выражении никакие два знака арифметических операций не стоят рядом. В записи чисел отсутствуют десятичные цифры.

В ответе укажите количество символов.

--- На пальцах ---


'''
f = open(r"2026\24\24_24536.txt")